src/Documents/Расписание/Расписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расписание</name>
  <registerRecords>AccumulationRegister.НагрузкаПреподавателей</registerRecords>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Занятия</name>
    <attributes>
      <name>Пара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗанятий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзJSON</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Расписание/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьРасписание(Команда)
	
	ЗаполнитьРасписаниеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасписаниеНаСервере()
	
	ФИОТранслитом = ПреобразованиеФИОТранслитом();
	
	Недели = ПолучитьНомераНедель();
	
	УдалитьЗагруженныеСтроки();
	
	Для Каждого НомерНедели Из Недели Цикл
		Результат = ПолучитьJSONПоСсылке(ФИОТранслитом, НомерНедели);
		
		ОбработатьJSONРасписание(Результат, НомерНедели);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗагруженныеСтроки()
	
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.Занятия Цикл
		Если СтрокаТЧ.ЗагруженИзJSON Тогда
			МассивУдаляемыхСтрок.Добавить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из МассивУдаляемыхСтрок Цикл
		Объект.Занятия.Удалить(СтрокаТЧ);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьНомераНедель()
	
	ТекущийГод = Год(ТекущаяДатаСеанса());
	ПредыдущийГод = ТекущийГод - 1;
	
	// Определяем номер месяца из перечисления
	НомерМесяца = ПолучитьНомерМесяца(Объект.Месяц);
	
	// Получаем начало месяца
	СентябрьНомер = 9;
	ДатаНачалаУчебногоГода = Дата(ПредыдущийГод, СентябрьНомер, 1);
	ДатаНачалаМесяца = Дата(ТекущийГод, НомерМесяца, 1);
	ДатаОкончанияМесяца = КонецМесяца(ДатаНачалаМесяца);
	СчетДаты = ДатаНачалаУчебногоГода;
	СчетчикНедель = 1;
	
	ДнейВНеделе = 7;
	Сутки = 24;
	МинутыСекунды = 60;
	Неделя = ДнейВНеделе * Сутки * МинутыСекунды * МинутыСекунды;
	
	Пока ДатаНачалаМесяца >= СчетДаты + Неделя Цикл
		СчетДаты = СчетДаты + Неделя;
		СчетчикНедель = СчетчикНедель + 1;
	КонецЦикла;
	
	МассивНедель = Новый Массив;
	МассивНедель.Добавить(СчетчикНедель);
	
	Пока ДатаОкончанияМесяца >= СчетДаты + Неделя Цикл
		СчетДаты = СчетДаты + Неделя;
		СчетчикНедель = СчетчикНедель + 1;
		МассивНедель.Добавить(СчетчикНедель);
	КонецЦикла;
	
	Возврат МассивНедель;
	
КонецФункции

&НаСервере
Функция ПолучитьНомерМесяца(Знач МесяцПеречисление)
	
	Возврат Перечисления.МесяцыГода.Индекс(МесяцПеречисление) + 1;
	
КонецФункции

&НаСервере
Функция ПреобразованиеФИОТранслитом()
	
	ФИО = Объект.Преподаватель.Наименование;
	
	// Приводим к нижнему регистру
	ФИО = НРег(ФИО);
	
	// Заменяем ё на е
	ФИО = СтрЗаменить(ФИО, "ё", "е");
	
	// Заменяем пробелы на дефис
	ФИО = СтрЗаменить(ФИО, " ", "-");
	
	// Транслитерация
	ТаблицаТранслита = Новый Соответствие;
	ТаблицаТранслита.Вставить("а", "a");
	ТаблицаТранслита.Вставить("б", "b");
	ТаблицаТранслита.Вставить("в", "v");
	ТаблицаТранслита.Вставить("г", "g");
	ТаблицаТранслита.Вставить("д", "d");
	ТаблицаТранслита.Вставить("е", "e");
	ТаблицаТранслита.Вставить("ж", "zh");
	ТаблицаТранслита.Вставить("з", "z");
	ТаблицаТранслита.Вставить("и", "i");
	ТаблицаТранслита.Вставить("й", "j");
	ТаблицаТранслита.Вставить("к", "k");
	ТаблицаТранслита.Вставить("л", "l");
	ТаблицаТранслита.Вставить("м", "m");
	ТаблицаТранслита.Вставить("н", "n");
	ТаблицаТранслита.Вставить("о", "o");
	ТаблицаТранслита.Вставить("п", "p");
	ТаблицаТранслита.Вставить("р", "r");
	ТаблицаТранслита.Вставить("с", "s");
	ТаблицаТранслита.Вставить("т", "t");
	ТаблицаТранслита.Вставить("у", "u");
	ТаблицаТранслита.Вставить("ф", "f");
	ТаблицаТранслита.Вставить("х", "h");
	ТаблицаТранслита.Вставить("ц", "c");
	ТаблицаТранслита.Вставить("ч", "ch");
	ТаблицаТранслита.Вставить("ш", "sh");
	ТаблицаТранслита.Вставить("щ", "sh");
	ТаблицаТранслита.Вставить("ъ", "u");
	ТаблицаТранслита.Вставить("ы", "y");
	ТаблицаТранслита.Вставить("ь", "");
	ТаблицаТранслита.Вставить("э", "e");
	ТаблицаТранслита.Вставить("ю", "yu");
	ТаблицаТранслита.Вставить("я", "ya");
	
	Результат = "";
	Для Инд = 1 По СтрДлина(ФИО) Цикл
		Символ = Сред(ФИО, Инд, 1);
		
		Если ТаблицаТранслита.Получить(Символ) <> Неопределено Тогда
			Результат = Результат + ТаблицаТранслита.Получить(Символ);
		
		Иначе
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьJSONПоСсылке(ФИОТранслитом, НомерНедели)
	
	Успех = Новый Структура("КодУспеха", 200);
	Таймаут = 30;
	
	ПараметрыЗапроса = "v=6.1&teacher=" + ФИОТранслитом + "&week=" + Формат(НомерНедели, "ЧГ=0");
	
	HTTPСоединение = Новый HTTPСоединение(
		"schedule.sevsu.ru", 
		, 
		, 
		, 
		, 
		Таймаут, 
		Новый ЗащищенноеСоединениеOpenSSL());
		
	HTTPЗапрос = Новый HTTPЗапрос("/api/teacher-schedule?" + ПараметрыЗапроса);
	
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния <> Успех.КодУспеха Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Ошибка получения данных: " + Ответ.КодСостояния;
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьJSONРасписание(РезультатJSON, НомерНедели)
	
	Если РезультатJSON = Неопределено Или НЕ РезультатJSON.ok Тогда
		Возврат;
	КонецЕсли;
	
	Занятия = РезультатJSON.schedule;
	
	ТекущийГод = Год(ТекущаяДатаСеанса());
	НомерМесяца = ПолучитьНомерМесяца(Объект.Месяц);
	ДатаНачалаМесяца = Дата(ТекущийГод, НомерМесяца, 1);
	
	Для Каждого Занятие Из Занятия Цикл				
		ДатаЗанятия = Дата(СтрЗаменить(Занятие.date, "-", ""));
		
		Если ДатаЗанятия <= ДатаНачалаМесяца Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Занятия.Добавить();
		НоваяСтрока.Дата = ДатаЗанятия;
		НоваяСтрока.Пара = Занятие.n;
		НоваяСтрока.Предмет = Занятие.lesson;
		НоваяСтрока.МестоЗанятий = Занятие.location;
		НоваяСтрока.ЗагруженИзJSON = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗанятияПередИзменением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Занятия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЗагруженИзJSON Тогда
		НеСпрашивать = ПолучитьНастройкуНеСпрашивать();
		
		Если НеСпрашивать Тогда
			Возврат;
			
		Иначе
			ПоказатьВопросОбИзменении(ТекущиеДанные);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОбИзменении(ТекущиеДанные)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветНаВопрос", ЭтотОбъект, ТекущиеДанные);
	
	ПоказатьВопрос(ОписаниеОповещения, 
		"Данная строка загружена из основного расписания. Вы действительно хотите изменить её?", 
		РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветНаНеСпрашивать", ЭтотОбъект, ТекущиеДанные);
		
		ПоказатьВопрос(ОписаниеОповещения, 
			"Не показывать больше этот вопрос?", 
			РежимДиалогаВопрос.ДаНет);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаНеСпрашивать(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СохранитьНастройкуНеСпрашивать(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкуНеСпрашивать()
	
	НеСпрашивать = Константы.НеСпрашиватьИзменениеJSON.Получить();
	Возврат НеСпрашивать;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкуНеСпрашивать(Знач Значение)
	
	Константы.НеСпрашиватьИзменениеJSON.Установить(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗанятияПриОкончанииРедактирования(Элемент, НоваяСтрока, Отказ)
	
	ТекущиеДанные = Элементы.Занятия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.ЗагруженИзJSON Тогда
		ПроверитьПересечениеСтроки(ТекущиеДанные, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПересечениеСтроки(ТекущиеДанные, Отказ)
	
	НайденнаяСтрока = НайтиПересечениеСЗагруженными(ТекущиеДанные);
	
	Если НайденнаяСтрока <> Неопределено Тогда
		ПараметрыВопроса = Новый Структура;
		ПараметрыВопроса.Вставить("ТекущиеДанные", ТекущиеДанные);
		ПараметрыВопроса.Вставить("НайденнаяСтрока", НайденнаяСтрока);
		ПараметрыВопроса.Вставить("Отказ", Отказ);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветНаВопросПересечения", ЭтотОбъект, ПараметрыВопроса);
		
		Вопрос = "Обнаружено пересечение с занятием, загруженным из расписания на " +
			Формат(НайденнаяСтрока.Дата, "ДЛФ=D") + ", пара " + НайденнаяСтрока.Пара + ". Продолжить?";

		ПоказатьВопрос(ОписаниеОповещения, Вопрос, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветНаВопросПересечения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		ДополнительныеПараметры.ТекущиеДанные.Дата = Неопределено;
		ДополнительныеПараметры.ТекущиеДанные.Пара = Неопределено;
	
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Объект.Занятия.Удалить(ДополнительныеПараметры.ТекущиеДанные);
	
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПересечениеСЗагруженными(ТекущиеДанные)
	
	Для Каждого СтрокаТЧ Из Объект.Занятия Цикл
		
		Если СтрокаТЧ.ЗагруженИзJSON И СтрокаТЧ <> ТекущиеДанные Тогда
			
			Если СтрокаТЧ.Дата = ТекущиеДанные.Дата И СтрокаТЧ.Пара = ТекущиеДанные.Пара Тогда
				Возврат СтрокаТЧ;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура УдалитьЗагруженное(Команда)
	
	УдалитьЗагруженныеСтроки();

КонецПроцедуры
